controllers/PegawaiController.php

    protected function findModel($id)
    {
        if (($model = Pegawai::findOne($id)) !== null) {
---
SELECT * FROM `pegawai` WHERE `id`='1'