views/pegawai/_form.php

    <?php //= $form->field($model, 'idjabatan')->textInput()
     // ambil data dari model masternya
    // ini menggunakan PHP murni
        $dataList = ArrayHelper::map(Jabatan::find()->asArray()->all(),'id','nama');
---
SELECT * FROM `jabatan`

    <?php //= $form->field($model, 'iddivisi')->textInput()
     // ambil data dari model masternya
    // ini menggunakan PHP murni
        $dataList = ArrayHelper::map(Divisi::find()->asArray()->all(),'id','nama');
---
SELECT * FROM `divisi`