views/pegawai/index.php

SELECT * FROM `jabatan`
SELECT * FROM `divisi`
---
            'tempat_lahir',
            //'tanggal_lahir',
            // 'idjabatan',
            [
                'attribute'=>'idjabatan', //foreign key
                'label'=>'Jabatan',
                'value'=>'idjabatan0.nama', //nama relasi dimodel
                'filter'=>ArrayHelper::map(Jabatan::find()->all(),'id','nama'),
            ],
            // 'iddivisi',
            [
                'attribute'=>'iddivisi', //foreign key
                'label'=>'Divisi',
                'value'=>'iddivisi0.nama', //nama relasi dimodel
                'filter'=>ArrayHelper::map(Divisi::find()->all(),'id','nama'),
            ],